print('''东汉建安五年，
曹操与袁绍军相持官渡。
曹操：
袁绍兵多将广，该如何取胜之？甚是烦恼啊。。。。
那么该进攻哪里呢？1.延津 2.乌巢''')
a=input("")
input('曹操：谁愿前往？')
if a=="1":
    input('关羽：关羽愿战以报曹公厚德')
elif a=="2":
    input('徐晃：末将，徐晃愿往。')

else:
    print('尔等依计袭敌粮道，断其后援')
#===========================================
input('''却说袁绍兴兵，望官渡进发。夏侯□发书告急。
曹操起军七万，前往迎敌，留荀□守许都。''')
input('绍兵临发，田丰从狱中上书谏曰：')
print('“今且宜静守以待天时，不可妄兴大兵，恐有不利。')
if a=="1":
    input('关羽：关羽愿战以报曹公厚德')
elif a=="2":
    input('逢纪谮曰：')
    input('主公兴仁义之师，田丰何得出此不祥之语！')

else:
    print('尔等依计袭敌粮道，断其后援')
#===========================================
input('''绍因怒，欲斩田丰。众官告免。''')
input('绍恨曰：')
input('待吾破了曹操，明正其罪！')
input('遂催军进发，旌旗遍野，刀剑如林。行至阳武，下定寨栅。')
if a=="1":
    input('关羽：关羽愿战以报曹公厚德')
elif a=="2":
    input('沮授曰：')
    input('''我军虽众，而勇猛不及彼军；彼军虽精，而粮草不如我军。
彼军无粮，利在急战；我军有粮，宜且缓守。若能旷以日月，则彼军不战自败矣。''')

else:
    print('尔等依计袭敌粮道，断其后援')
